{
  "backend/main.mo": "Actor implementing user profiles, phone-to-principal lookup, presence, and call signaling with access control checks and stored maps.",
  "backend/migration.mo": "Migration module building a phone-to-principal map from old userProfiles and returning a new actor state.",
  "feature_evidence.json": "Feature evidence report listing frontend files, features, components, and test IDs for call-flow and callee lookup updates.",
  "frontend-file-summaries.txt": "Reference file containing high-level summaries for all major frontend modules and hooks.",
  "frontend/index.css": "Global Tailwind CSS setup defining OKLCH-based color variables for light and dark themes with base styling.",
  "frontend/index.html": "HTML entry point mounting the root element and loading the main React script.",
  "frontend/src/App.tsx": "Main React app component handling authentication, profile setup gating, loading states, and rendering the primary layout.",
  "frontend/src/features/auth/LoginButton.tsx": "Authentication button component handling Internet Identity login/logout and query cache reset.",
  "frontend/src/features/branding/FoscoBranding.tsx": "Branding component displaying the FOSCO logo and wordmark in small or large formats.",
  "frontend/src/features/call/CallSurface.tsx": "Manages call UI states, binds WebRTC streams to video elements, and wires answer/end/mute/camera actions based on call status.",
  "frontend/src/features/call/InCallControls.tsx": "Renders buttons for mute, camera toggle, and ending a call using passed-in handlers and state flags.",
  "frontend/src/features/call/IncomingCallPrompt.tsx": "Displays an incoming call card with caller info and answer/decline actions.",
  "frontend/src/features/call/OutgoingCallPanel.tsx": "Provides UI to enter a phone number, look up a callee, and initiate a call with status handling.",
  "frontend/src/features/call/useCalleeLookup.ts": "Looks up a user by phone number via backend actor calls, returning principal, profile, and availability.",
  "frontend/src/features/call/useWebRTCCall.ts": "Implements WebRTC call setup, signaling, media initialization, and connection state handling with hooks.",
  "frontend/src/features/layout/FacetimeOverlay.tsx": "Provides a styled fixed-position container for displaying the call interface with size variants.",
  "frontend/src/features/layout/FoscoLayout.tsx": "Main app layout combining header, movie window, call overlay, call controls, and fullscreen logic.",
  "frontend/src/features/layout/MovieWindow.tsx": "Displays a screen-share video or placeholder and supports fullscreen toggling during calls.",
  "frontend/src/features/layout/useFullscreen.ts": "Hook managing entering, exiting, and tracking browser fullscreen state for a given element.",
  "frontend/src/features/profile/PhoneNumberSetupCard.tsx": "Form card for entering and saving initial caller profile with name and phone number using save profile mutation.",
  "frontend/src/features/profile/ProfileDialog.tsx": "Dialog for viewing and editing existing caller profile, preloading data and saving updates.",
  "frontend/src/features/screenShare/ScreenShareControls.tsx": "UI controls for starting or stopping screen sharing with error display.",
  "frontend/src/features/screenShare/useScreenShare.ts": "Hook managing screen share stream, permissions, backend enable/disable calls, and error handling.",
  "frontend/src/features/share/ShareButton.tsx": "Button that shares the app URL using Web Share API or clipboard fallback.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor instance tied to identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useAvailability.ts": "Marks user available or unavailable based on mount and page visibility using actor methods.",
  "frontend/src/hooks/useCallerProfile.ts": "Hooks for fetching and saving caller user profile via actor with react-query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity auth client, identities, and login state.",
  "frontend/src/hooks/useQueries.ts": "Collection of hooks for call status polling, call actions, signaling, and screen cast mutations using actor.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive OKLCH CSS variables for light/dark themes and global base styles.",
  "frontend/src/lib/utils.ts": "Provides a helper function that merges conditional class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider before rendering App.",
  "frontend/src/utils/urlParams.ts": "Implements helpers for reading, storing, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, extended OKLCH theme variables, custom animations, and plugins.",
  "project_state.json": "Describes the project’s current state, existing features, issues, and architectural notes for the FOSCO app."
}