{
  "backend/main.mo": "Motoko actor implementing user profiles, presence, call state, and signaling with authorization checks.",
  "feature_evidence.json": "Feature evidence report mapping features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Root HTML document loading the React application entrypoint.",
  "frontend/src/App.tsx": "Main app component handling authentication, profile gating, loading states, and rendering the primary layout.",
  "frontend/src/features/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading and error handling.",
  "frontend/src/features/branding/FoscoBranding.tsx": "Branding component rendering the FOSCO logo and wordmark in two sizes.",
  "frontend/src/features/call/CallSurface.tsx": "Renders call UI, manages WebRTC streams, handles answering, ending, and displaying call state.",
  "frontend/src/features/call/InCallControls.tsx": "Provides mute, camera toggle, and end-call buttons for an active call.",
  "frontend/src/features/call/IncomingCallPrompt.tsx": "Displays incoming call prompt with answer and decline actions.",
  "frontend/src/features/call/OutgoingCallPanel.tsx": "Allows initiating a call by phone number, performing lookup and triggering call logic.",
  "frontend/src/features/call/useCalleeLookup.ts": "Looks up a user profile by phone number and reports availability status.",
  "frontend/src/features/call/useWebRTCCall.ts": "Manages WebRTC setup, media initialization, signaling, and call lifecycle.",
  "frontend/src/features/layout/FacetimeOverlay.tsx": "Positions a facetime-style overlay container with adjustable size based on fullscreen state.",
  "frontend/src/features/layout/FoscoLayout.tsx": "Main app layout that manages call state, screensharing, fullscreen behavior, and UI composition.",
  "frontend/src/features/layout/MovieWindow.tsx": "Displays screen share video or placeholder content with fullscreen toggle.",
  "frontend/src/features/layout/useFullscreen.ts": "Hook that manages entering, exiting, and tracking fullscreen state.",
  "frontend/src/features/profile/PhoneNumberSetupCard.tsx": "Form card for entering and saving a user's display name and phone number using saveCallerUserProfile.",
  "frontend/src/features/profile/ProfileDialog.tsx": "Settings dialog allowing users to view and update their saved display name and phone number.",
  "frontend/src/features/screenShare/ScreenShareControls.tsx": "UI controls to start or stop screen sharing and display any related error messages.",
  "frontend/src/features/screenShare/useScreenShare.ts": "Hook managing screen‑share state, requesting display media, and calling backend enable/disable mutations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useAvailability.ts": "Marks the user as available or unavailable through actor calls based on mount and page visibility.",
  "frontend/src/hooks/useCallerProfile.ts": "Hooks for fetching and saving the current user's caller profile via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login/logout handling, and initialization logic using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of backend query and mutation hooks for call status, call actions, signal messaging, and screen‑cast control.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines extensive OKLCH-based theme variables for light and dark modes.",
  "frontend/src/lib/utils.ts": "Provides a cn helper combining clsx and tailwind-merge for class name merging.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and InternetIdentityProvider, loading App and global styles.",
  "frontend/src/utils/urlParams.ts": "Implements utilities for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH color tokens, radius, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing FOSCO’s goals, requirements, features, and build state."
}