{
  "backend/main.mo": "Motoko backend actor managing user profiles, phone lookups, presence, and call lifecycle with access control and signal storage.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, related frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files describing their roles in authentication, calls, UI, and WebRTC logic.",
  "frontend/index.css": "Global Tailwind CSS configuration defining theme variables, dark mode values, and base styles.",
  "frontend/index.html": "Basic HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app component handling authentication, profile setup, loading states, and rendering the full layout.",
  "frontend/src/features/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with loading states and query cache clearing.",
  "frontend/src/features/branding/FoscoBranding.tsx": "Branding component displaying FOSCO logo and wordmark in small or large variants.",
  "frontend/src/features/call/CallSurface.tsx": "Core call UI component managing incoming and in-call states, wiring backend actions with WebRTC, and rendering video elements.",
  "frontend/src/features/call/InCallControls.tsx": "Renders call control buttons for mute, camera toggle, and ending a call with disabled state support.",
  "frontend/src/features/call/IncomingCallPrompt.tsx": "Displays an incoming call card showing caller info with answer and decline actions.",
  "frontend/src/features/call/OutgoingCallPanel.tsx": "Provides UI to enter a phone number, lookup a callee, and initiate a call with loading and error handling.",
  "frontend/src/features/call/useCalleeLookup.ts": "Custom hook that resolves a phone number to a user principal, checks availability, and returns profile data with errors.",
  "frontend/src/features/call/useWebRTCCall.ts": "Manages WebRTC call setup, media streams, signaling, and connection state with hooks.",
  "frontend/src/features/layout/FacetimeOverlay.tsx": "Wraps call UI in a fixed overlay with size variations based on fullscreen state.",
  "frontend/src/features/layout/FoscoLayout.tsx": "Main app layout coordinating header, movie window, call surface, and screen‑share or call controls.",
  "frontend/src/features/layout/MovieWindow.tsx": "Displays a screen‑sharing video stream or placeholder content with a fullscreen toggle.",
  "frontend/src/features/layout/useFullscreen.ts": "Hook providing fullscreen enter, exit, and toggle behavior with state tracking.",
  "frontend/src/features/profile/PhoneNumberSetupCard.tsx": "Form card allowing users to save their display name and phone number with validation and toasts.",
  "frontend/src/features/profile/ProfileDialog.tsx": "Dialog UI for viewing and editing caller profile with save mutations and validation.",
  "frontend/src/features/screenShare/ScreenShareControls.tsx": "Renders start/stop screen sharing button and displays errors.",
  "frontend/src/features/screenShare/useScreenShare.ts": "Custom hook managing screen share stream, backend sync, and error handling.",
  "frontend/src/features/share/ShareButton.tsx": "Share button using Web Share API with clipboard fallback and toast feedback.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated/anonymous actor instance and invalidates dependent queries.",
  "frontend/src/hooks/useAvailability.ts": "Marks user availability on mount, unmount, and visibility changes via actor calls.",
  "frontend/src/hooks/useCallerProfile.ts": "Profile fetch and save hooks using actor methods with react-query caching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading, login, and logout handling.",
  "frontend/src/hooks/useQueries.ts": "Collection of react-query hooks for call state, signaling, and screen-cast operations.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables for light/dark themes and UI elements.",
  "frontend/src/lib/utils.ts": "Utility to merge Tailwind class names using clsx and twMerge.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the InternetIdentityProvider before rendering App.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and session-based parameters, including hash‑query parsing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, animations, and plugins like typography, container queries, and animate.",
  "project_state.json": "Defines the project’s current state, including requirements, features, issues, and architectural notes for the FOSCO app."
}