{
  "backend/main.mo": "Main canister implementing authorization, user profiles, phone lookup, presence, call state, and signaling storage.",
  "backend/migration.mo": "Migration logic converting old call status structure to the new one while preserving stored state.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files for reference.",
  "frontend/index.css": "Global Tailwind-based theme variables and base styling for light and dark modes.",
  "frontend/index.html": "Root HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level app component handling authentication, profile setup flow, and rendering the main layout.",
  "frontend/src/features/auth/LoginButton.tsx": "Auth button that handles login/logout with Internet Identity and clears React Query cache on logout.",
  "frontend/src/features/branding/FoscoBranding.tsx": "Branding component rendering FOSCO logo and wordmark in small or large variants.",
  "frontend/src/features/call/CallSurface.tsx": "Manages call UI states, connects WebRTC hooks with backend call status, and renders incoming prompts, in-call video, and controls.",
  "frontend/src/features/call/InCallControls.tsx": "Renders buttons for muting, disabling camera, and ending a call.",
  "frontend/src/features/call/IncomingCallPrompt.tsx": "Displays an incoming call card with answer and decline actions.",
  "frontend/src/features/call/OutgoingCallPanel.tsx": "Handles phone-number lookup and initiates outgoing calls with validation and loading states.",
  "frontend/src/features/call/useCalleeLookup.ts": "Looks up a user by phone number, checking principal, availability, and profile via backend actor calls.",
  "frontend/src/features/call/useWebRTCCall.ts": "Implements WebRTC call setup, signaling, media initialization, peer connection handling, and call lifecycle state.",
  "frontend/src/features/layout/FacetimeOverlay.tsx": "Provides a positioned overlay container for Facetime-style video elements.",
  "frontend/src/features/layout/FoscoLayout.tsx": "Main app layout integrating branding, calls, screen sharing, overlays, and controls.",
  "frontend/src/features/layout/MovieWindow.tsx": "Displays shared screen stream or placeholder content with optional fullscreen toggle during calls.",
  "frontend/src/features/layout/useFullscreen.ts": "Hook managing entering, exiting, and tracking fullscreen state.",
  "frontend/src/features/profile/PhoneNumberSetupCard.tsx": "Form card for entering and saving a user's display name and phone number using saveCallerUserProfile.",
  "frontend/src/features/profile/ProfileDialog.tsx": "Dialog for viewing and editing the user's profile, prefilled from getCallerUserProfile and saved via saveCallerUserProfile.",
  "frontend/src/features/screenShare/ScreenShareControls.tsx": "UI controls for starting or stopping screen sharing with optional error display.",
  "frontend/src/features/screenShare/useScreenShare.ts": "Hook managing screen sharing state, requesting display media, enabling/disabling backend screencast, and handling errors.",
  "frontend/src/features/share/ShareButton.tsx": "Button that shares the app URL via Web Share API or clipboard fallback with user feedback.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an actor based on the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAvailability.ts": "Marks the user available or unavailable via actor calls based on mount and page visibility.",
  "frontend/src/hooks/useCallerProfile.ts": "Hooks for fetching and saving the current user's profile via actor with react-query caching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login, stored identities, and auth-client interactions.",
  "frontend/src/hooks/useQueries.ts": "Collection of hooks for call state, signaling, and screencast operations using actor-backed queries and mutations.",
  "frontend/src/index.css": "Sets Tailwind layers and defines extensive light/dark theme OKLCH CSS variables and base styles.",
  "frontend/src/lib/utils.ts": "Exports a cn() helper that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider and loads global styles.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL params, persisting them in sessionStorage, and cleaning hash parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors from CSS variables, adding animations, and enabling plugins.",
  "project_state.json": "Project metadata describing feature requirements, state, issues, and architecture for the FOSCO app."
}