{
  "kind": "build_request",
  "title": "Fix incoming call Accept/Decline actions for callee",
  "projectName": "FOSCO",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-16",
      "text": "Fix the incoming call flow so that the callee can successfully press “Answer” or “Decline” and the app performs the correct call actions (no-op clicks must be eliminated).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "I am now able to call other users, however the users who I call are unable to press the accept or decline buttons. Please fix this problem"
        ]
      },
      "acceptanceCriteria": [
        "When a user is receiving a call (incoming state), clicking “Answer” triggers the answer flow and transitions the UI into the in-call state.",
        "When a user is receiving a call (incoming state), clicking “Decline” ends/rejects the call and returns both users to an idle/available state.",
        "The “Answer” button is not gated by an incorrect callStatus kind check (i.e., it must be actionable while in the incoming state)."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Update the backend call status model so that the callee’s incoming call state includes sufficient information to answer/decline (at minimum: the caller’s Principal), and update backend call lifecycle methods accordingly.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "users who I call are unable to press the accept or decline buttons"
        ]
      },
      "acceptanceCriteria": [
        "backend/main.mo: The CallStatus variant for an incoming call carries the caller Principal (e.g., incoming-with-caller), so the frontend can call answer/decline with the correct party reference.",
        "backend/main.mo: initiateCall stores the caller Principal in the callee’s incoming call status.",
        "backend/main.mo: The callee can decline an incoming call without trapping; declining resets both participants’ callStates back to #none (or equivalent idle state).",
        "backend/main.mo: Existing answer behavior continues to work, and answering transitions both participants to the in-call state using the same caller/callee principals."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Update the frontend incoming call UI wiring to use the incoming-call caller Principal provided by the backend, and call the correct backend mutations for answer/decline so the buttons always have an effect.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "unable to press the accept or decline buttons"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/features/call/CallSurface.tsx: handleAnswer uses the incoming call payload (caller Principal) rather than reading from the in-call payload.",
        "frontend/src/features/call/CallSurface.tsx: handleDecline calls a backend path that correctly rejects/ends an incoming call (no backend trap), and the UI returns to the idle state afterwards.",
        "IncomingCallPrompt remains clickable and does not appear “dead” due to missing handler logic."
      ]
    },
    {
      "id": "REQ-19",
      "text": "If changing the backend CallStatus type requires an upgrade-safe state transition, add/adjust backend migration logic to handle existing persisted state safely (e.g., clear or transform callStates for old incoming entries).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ]
      },
      "acceptanceCriteria": [
        "A canister upgrade does not fail due to the CallStatus type change.",
        "After upgrade, users are not stuck in a broken incoming state from pre-upgrade data."
      ]
    }
  ],
  "constraints": [
    "Keep all Motoko logic in the single actor in backend/main.mo (single-actor architecture).",
    "Do not edit files under frontend/src/components/ui or any frontend immutablePaths listed in SYSTEM_CONTEXT; compose those components instead.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding group calls or multi-party calling.",
    "Adding third-party authentication providers (only Internet Identity).",
    "Adding real-time transport mechanisms beyond the existing polling-based signaling design."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}