{
  "kind": "build_request",
  "title": "Fix missing incoming call accept/decline prompt for callees",
  "projectName": "FOSCO",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-20",
      "text": "Ensure that when a user is being called, the UI reliably shows an incoming-call prompt with actionable “Answer” and “Decline” controls in the Facetime overlay (instead of showing an idle state with no accept option).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "When called, it does not give an option for users being called to accept the call. Please fix this problem"
        ]
      },
      "acceptanceCriteria": [
        "With two signed-in users marked available, initiating a call causes the callee’s UI to render the IncomingCallPrompt (with the visible text “Incoming Call”, “Answer”, and “Decline”).",
        "The incoming-call prompt is shown until the callee answers or declines, or until the caller ends the call.",
        "The callee never remains stuck on the “No active call” idle state while backend call status is #incoming for that callee."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Fix the incoming-call action wiring so that pressing “Answer” or “Decline” always performs the correct backend mutations and the call transitions to the expected state (no no-op clicks).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "When called, it does not give an option for users being called to accept the call. Please fix this problem"
        ]
      },
      "acceptanceCriteria": [
        "Clicking “Decline” moves the callee’s call status to #none and clears the caller’s call status back to #none (when the caller was ringing/attempting the call).",
        "Clicking “Answer” transitions both participants to #inCall and starts the WebRTC flow only after the callee answers.",
        "If the backend rejects Answer/Decline (e.g., no incoming call), the frontend shows an English error message and the UI remains consistent (no silent failure)."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Fix WebRTC signaling handling on the callee side so that answering an incoming call successfully processes any already-received offer/ICE messages after the peer connection is created (preventing ‘answer’ from appearing to do nothing).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "When called, it does not give an option for users being called to accept the call. Please fix this problem"
        ]
      },
      "acceptanceCriteria": [
        "If the caller’s offer arrives before the callee clicks “Answer”, then after the callee clicks “Answer” the offer is still processed and the call connects successfully (remote video/audio can be established).",
        "Answering an incoming call does not require the caller to re-initiate the call for the connection to complete.",
        "Signal processing does not depend solely on future polling updates when there are already pending signals available at the moment the peer connection is created."
      ]
    }
  ],
  "constraints": [
    "Keep all Motoko logic in the single backend actor (backend/main.mo); only introduce backend/migration.mo changes if an upgrade-safe state transition is required.",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "All user-facing text must be in English."
  ],
  "nonGoals": [
    "Adding new calling features beyond fixing the missing incoming call accept/decline experience (e.g., group calls, call history, notifications).",
    "Introducing external services (push notifications, SMS, email, WebSockets) or non-supported backend stacks/databases."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}