{
  "kind": "build_request",
  "title": "Fix phone-number-to-principal lookup so users can initiate calls",
  "projectName": "FOSCO",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-13",
      "text": "Add a backend API that allows an authenticated user to resolve a callee Principal from a phone number so that phone-number-based calling can be initiated without the current \"principal lookup not available\" limitation.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "When I try to call a user it is telling me \"Unable to initiate call - principle lookup not available\" please enable users to initiate calls and ensure that principle lookup is available."
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a method that takes a phone number (Text) and returns the matching user Principal (or null/None when not found).",
        "The lookup is permission-protected consistently with existing profile lookup endpoints (user permission required).",
        "The lookup implementation searches the existing in-memory profile map by phone number and returns the corresponding principal (not just the profile).",
        "No user-facing trap message contains the misspelling \"principle\"; any new user-facing text is English."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Update the frontend outgoing call flow to use the new backend phone-number-to-principal lookup and successfully call actor.initiateCall with the resolved Principal, removing the hardcoded error toast \"Unable to initiate call - principal lookup not available\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Unable to initiate call - principle lookup not available"
        ]
      },
      "acceptanceCriteria": [
        "From the \"Make a Call\" panel, entering a valid phone number for an existing user resolves the callee principal and initiates the call via the existing initiateCall mutation.",
        "The previous toast message \"Unable to initiate call - principal lookup not available\" is no longer shown in normal operation and is removed from the call path.",
        "If the phone number does not match any user, the UI shows an English error message indicating the user was not found.",
        "If the callee exists but is not available, the UI shows an English error message indicating the user is not available."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Fix the frontend callee lookup hook so it does not perform redundant/incorrect calls (currently calling getUserByPhoneNumber twice) and so it can accurately report: (1) user exists, (2) user is available, using principal-based availability checks.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ]
      },
      "acceptanceCriteria": [
        "The callee lookup uses phone number to obtain the callee principal (via the new backend lookup) and then checks availability using the existing backend isAvailable(principal) API.",
        "The lookup returns consistent results: \"User not found\" only when no principal/profile exists for the phone number; \"User not available\" only when the user exists but is not available.",
        "All user-facing error strings introduced/changed by this requirement are in English."
      ]
    }
  ],
  "constraints": [
    "Keep all Motoko logic within the existing single actor in backend/main.mo (no additional backend services).",
    "Do not edit frontend files under the immutable paths listed in SYSTEM_CONTEXT (compose existing UI components instead).",
    "Do not introduce external databases or third-party auth; Internet Identity remains the only auth mechanism."
  ],
  "nonGoals": [
    "Do not add contact syncing, address book integration, or phone number verification via SMS.",
    "Do not change the overall call UI/UX beyond what is required to make principal lookup work and calling succeed.",
    "Do not implement group calling or multi-party sessions."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}