{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix phone-number-based callee principal lookup in outgoing call flow (frontend)",
  "requirements": [
    {
      "id": "REQ-14",
      "summary": "Update the outgoing call UI to resolve callee Principal from a phone number and initiate calls without the legacy hardcoded error.",
      "acceptanceCriteria": [
        "From the \"Make a Call\" panel, entering a valid phone number for an existing user resolves the callee principal and initiates the call via the existing initiateCall mutation.",
        "The previous toast message \"Unable to initiate call - principal lookup not available\" is no longer shown in normal operation and is removed from the call path.",
        "If the phone number does not match any user, the UI shows an English error message indicating the user was not found.",
        "If the callee exists but is not available, the UI shows an English error message indicating the user is not available."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/call/OutgoingCallPanel.tsx",
          "operation": "modify",
          "description": "Replace the current phone-number call path (which calls getUserByPhoneNumber and then toasts the hardcoded principal-lookup error) with a flow that uses the callee lookup result to obtain the callee Principal and then calls the existing useInitiateCall mutation with that Principal. Ensure user-facing errors are English and show \"User not found\" when no match exists and \"User is not available\" when the user exists but availability is false. Remove the legacy toast string entirely from the call path."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Fix the callee lookup hook to avoid redundant calls and report existence vs availability using principal-based availability checks.",
      "acceptanceCriteria": [
        "The callee lookup uses phone number to obtain the callee principal (via the new backend lookup) and then checks availability using the existing backend isAvailable(principal) API.",
        "The lookup returns consistent results: \"User not found\" only when no principal/profile exists for the phone number; \"User not available\" only when the user exists but is not available.",
        "All user-facing error strings introduced/changed by this requirement are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/call/useCalleeLookup.ts",
          "operation": "modify",
          "description": "Refactor lookupByPhoneNumber to: (1) normalize/trim the phone number once, (2) resolve the callee Principal via actor.getPrincipalFromPhoneNumber(phoneNumber), (3) only if a Principal is resolved, fetch the profile once (as needed for display) and check availability via actor.isAvailable(principal). Update the hook return shape to include the resolved Principal and availability status so callers can reliably distinguish \"User not found\" vs \"User is not available\" without duplicating backend calls."
        },
        {
          "path": "frontend/src/features/call/OutgoingCallPanel.tsx",
          "operation": "modify",
          "description": "Update the panel to consume the revised useCalleeLookup result (including callee Principal and availability status) so it no longer performs any redundant lookup calls and always initiates calls with the resolved Principal when available."
        }
      ]
    }
  ]
}