{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix callee incoming call Answer/Decline wiring",
  "requirements": [
    {
      "id": "REQ-16",
      "summary": "Ensure incoming-call Answer/Decline buttons are actionable for the callee and drive correct UI state transitions.",
      "acceptanceCriteria": [
        "When a user is receiving a call (incoming state), clicking “Answer” triggers the answer flow and transitions the UI into the in-call state.",
        "When a user is receiving a call (incoming state), clicking “Decline” ends/rejects the call and returns both users to an idle/available state.",
        "The “Answer” button is not gated by an incorrect callStatus kind check (i.e., it must be actionable while in the incoming state)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/call/CallSurface.tsx",
          "operation": "modify",
          "description": "Fix callee incoming-call action handlers so Answer is enabled for CallStatus.__kind__ === 'incoming' (not 'inCall'); use the incoming payload’s caller Principal for WebRTC answer setup; ensure Decline triggers a real reject/end action and locally tears down any in-progress WebRTC state so the UI returns to idle."
        },
        {
          "path": "frontend/src/features/call/IncomingCallPrompt.tsx",
          "operation": "modify",
          "description": "Ensure the incoming prompt remains clearly clickable and reflects action-in-progress states (e.g., disable buttons only while mutations are pending) without breaking existing Answer/Decline handler wiring."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Wire incoming-call UI to use backend-provided caller Principal and invoke the correct backend mutations for answer/decline so clicks always have an effect.",
      "acceptanceCriteria": [
        "frontend/src/features/call/CallSurface.tsx: handleAnswer uses the incoming call payload (caller Principal) rather than reading from the in-call payload.",
        "frontend/src/features/call/CallSurface.tsx: handleDecline calls a backend path that correctly rejects/ends an incoming call (no backend trap), and the UI returns to the idle state afterwards.",
        "IncomingCallPrompt remains clickable and does not appear “dead” due to missing handler logic."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Align call-action mutations with the current backend interface for answering/ending calls (e.g., answerCall/endCall argument shapes) and ensure successful mutations invalidate the callStatus query so the UI reliably transitions out of incoming and into in-call/idle states."
        },
        {
          "path": "frontend/src/features/call/CallSurface.tsx",
          "operation": "modify",
          "description": "Update handleAnswer/handleDecline to use the backend-provided CallStatus.incoming.caller Principal for WebRTC setup while calling the correct backend mutations for answering/declining; remove any no-op guards so button clicks always trigger the intended flows."
        }
      ]
    }
  ]
}